{
  "magical-objects": {
    "Wizengamot Chair": {
      "Name": "Wizengamot Chair",
      "Owners": "British Ministry of Magic",
      "Use": "This was a special chair that was in the centre of a dais at Courtroom Ten, where the accused would sit during a trial before the Council of Magical Law and in later years in the Wizengamot, a section of the Ministry of Magic",
      "Appearances": "Harry Potter and the Goblet of Fire (first appearance) (appears in flashback(s))"
    },
    "Admonitor": {
      "Name": "Admonitor",
      "Owners": "British Ministry of Magic, Magical Congress of the United States of America",
      "Use": "The Admontir was a magical bracelet or cuff that monitored the magical activity of the wearer. In any case of trouble, it would glow red and MACUSA would come to the situation. In the 1920s, both the British Ministry of Magic and the Magical Congress of the United States of America (MACUSA) employed these against suspects under surveillance.",
      "Appearances": "Fantastic Beasts: The Crimes of Grindelwald - The Original Screenplay, Fantastic Beasts: The Crimes of Grindelwald"
    },
    "Alastor Moody's Magical Eye": {
      "Name": "Alastor Moody's Magical Eye",
      "Owners": "Alastor Moody, Bartemius Crouch Junior (stolen), Dolores Umbridge, Harry Potter",
      "Use": "Moody's magical eye was an eye replacement that was capable of seeing through objects and the back of one's own head",
      "Appearances": "Harry Potter and the Goblet of Fire (first appearance), Harry Potter and the Goblet of Fire (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Order of the Phoenix (film), Harry Potter and the Half-Blood Prince (film) (flashback in disc 2), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 1"
    },
    "Alastor Moody's Walking Stick": {
      "Name": "Alastor Moody's Walking Stick",
      "Owners": "Alastor Moody, Bartemius Crouch Junior (stolen)",
      "Use": "Moody's walking stick was a magical weapon, containing some offensive magical power",
      "Appearances": "Harry Potter and the Goblet of Fire (first appearance), Harry Potter and the Goblet of Fire (film), Harry Potter and the Order of the Phoenix (film), Harry Potter and the Half-Blood Prince (film) (flashback disc 2), Harry Potter and the Deathly Hallows: Part 1 (film)"
    },
    "Albus Dumbledore's Silver Instruments": {
      "Name": "Albus Dumbledore's Silver Instruments",
      "Owners": "Albus Dumbledore",
      "Use": "Unknown magic used",
      "Appearances": "Harry Potter and the Chamber of Secrets (first appearance), Harry Potter and the Chamber of Secrets (film), Harry Potter and the Goblet of Fire (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Order of the Phoenix (film), Harry Potter and the Half-Blood Prince, Harry Potter and the Half-Blood Prince (film), Harry Potter and the Deathly Hallows: Part 2 (film) (appears in flashbacks)"
    },
    "Anti-Cheating Quill": {
      "Name": "Anti-Cheating Spell",
      "Owners": "Hogwarts School of Witchcraft and Wizardry",
      "Use": "This was used as a special quill on which an Anti-Cheating Spell had been placed in order to make it impossible to cheat.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Philosopher's Stone (film) (mentioned in deleted scene), Harry Potter and the Order of the Phoenix, Harry Potter and the Order of the Phoenix (film)"
    },
    "Auto-Answer Quill": {
      "Name": "Auto-Answer Quill",
      "Owners": "N/A",
      "Use": "This object most likely wrote out the answer to questions automatically. In 1996, they were banned during Ordinary Wizarding Level examinations at Hogwarts School of Witchcraft and Wizardry.",
      "Appearances": "Harry Potter and the Order of the Phoenix (first mentioned)"
    },
    "Beater's Bat": {
      "Name": "Beater's Bat",
      "Owners": "Quidditch Players",
      "Use": "The bat was a piece of Quidditch equipment used by Beaters, in the game of Quidditch, to hit Bludgers away from their own team members and towards players on the other team. The bats were magically reinforced to give them greater strength.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and Philosopher's Stone (film), Harry Potter and the Chamber of Secrets, Harry Potter and the Chamber of Secrets (film), Harry Potter and the Prisoner of Azkaban, Harry Potter and the Prisoner of Azkaban (film), Harry Potter and the Goblet of Fire, Harry Potter and the Order of the Phoenix, Harry Potter and Half-Blood Prince, Harry Potter and the Half-Blood Prince (film)"
    },
    "Bell Jar of Time": {
      "Name": "Bell Jar of Time",
      "Owners": "Department of Mysteries",
      "Use": "This object causes a living being to rapidly cycle through youth and old age",
      "Appearances": "Harry Potter and the Order of the Phoenix (first appearance)"
    },
    "Bewitched Tea Set": {
      "Name": "Bewitched Tea Set",
      "Owners": "An old witch (formerly), a muggle woman",
      "Use": "This object was used for serving that went berserk and squirted boiling tea everywhere.",
      "Appearances": "Harry Potter and the Chamber of Secrets (first mentioned)"
    },
    "Bludger": {
      "Name": "Bludger",
      "Owners": "Quidditch Players",
      "Use": "This object is used to knock players off their broomsticks in Quidditch",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Philosopher's Stone (film), Harry Potter and the Chamber of Secrets, Harry Potter and the Chamber of Secrets (film), Harry Potter and the Prisoner Azkaban, Harry Potter and the Prisoner of Azkaban (film), Harry Potter and the Goblet of Fire, Harry Potter and the Order of the Phoenix, Harry Potter and the Half-Blood Prince, Harry Potter and Deathly Hallows (mentioned only)"
    },
    "Broomstick": {
      "Name": "Broomstick",
      "Owners": "Harry Potter, Alastor Moody, Remus Lupin, Remus, Lupin, Nymphadora Tonks, Advance Guard, Rolanda Hooch, Weasley's, Draco Malfoy, Quidditch teams, many other Hogwarts students, many other leisure Quidditch players",
      "Use": "This object is used to transport wizards and witches between locations, as well as for broom games",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Philosopher's Stone (film), Harry Potter and the Chamber of Secrets, Harry Potter and the Chamber of Secrets (film), Harry Potter and the Prisoner Azkaban, Harry Potter and the Prisoner of Azkaban (film), Harry Potter and the Goblet of Fire, Harry Potter and the Goblet of Fire (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Order of the Phoenix (film), Harry Potter and the Half-Blood Prince, Harry Potter and the Half-Blood Prince (film), Harry Potter and Deathly Hallows (mentioned only), Harry Potter and Deathly Hallows: Part 1 (film), Harry Potter and Deathly Hallows: Part 2 (film), Fantastic Beasts: The Crimes of Grindelwald - The Original Screenplay, Fantastic Beasts: The Crimes of Grindelwald (film)"
    },
    "Broom Broom Kit": {
      "Name": "Broom Broom Kit",
      "Owners": "N/A",
      "Use": "This object was a broomstick-modifying kit sold at Weasley's Wizard Wheezes in Diagon Alley. It promised to 'bling up your broom' and included a pointed cap for the end of the handle, a pair of fins that slid onto the handle, a tail fin that was attached on top of the bristles, and a rocket booster for the back underside",
      "Appearances": "Harry Potter and the Half-Blood Prince (film)"
    },
    "Broom Compass": {
      "Name": "Broom Compass",
      "Owners": "Harry Potter, Ron Weasley",
      "Use": "A Broom Compass was a broomstick accessory that helped the rider find the direction they were travelling in. They could be clipped onto broomsticks for long journeys and were made of brass.",
      "Appearances": "Harry Potter and the Prisoner of Azkaban (first appearance), Harry Potter and the Order of the Phoenix (first identified as broom compass)"
    },
    "Bubble Bow Booster": {
      "Name": "Bubble Blow Booster",
      "Owners": "Luna Lovegood",
      "Use": "Bubble Blow Booster blew magical bubbles (presumably)",
      "Appearances": "Harry Potter and the Order of the Phoenix (film) (first mentioned) (mentioned on a poster)"
    },
    "Cauldron": {
      "Name": "Cauldron",
      "Owners": "Hogwarts School of Witchcraft and Wizardry Students, Wizardkind, Muggles",
      "Use": "This object is a vessel similar to a bucket or kettle, which was used to brew and hold potions and also used to carry supplies.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Philosopher's Stone (film), Harry Potter and the Chamber of Secrets, Harry Potter and the Chambers of Secrets (film), Harry Potter and the Prisoner of Azkaban, Harry Potter and the Prisoner of Azkaban (film), Harry Potter and the Goblet of Fire, Harry Potter and the GOblet of Fire (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Order of the Phoenix (film), Harry Potter and the Half-Blood Prince, Harry Potter and the Half-Blood Prince (film), Harry Potter and the Deathly Hallows"
    },
    "Charge": {
      "Name": "Charge",
      "Owners": "Seamus Finnigan (possibly)",
      "Use": "This object is a Type of explosive object, possibly invented by Seamus Finnegan",
      "Appearances": "Harry Potter and the Deathly Hallows: Part 2"
    },
    "Charmed Tent": {
      "Name": "Charmed Tent",
      "Owners": "Finnigan family, Perkins, Percival Shacklehorn, William Weasley, Wood family",
      "Use": "This object is a tent consisting of sheets of fabric or other materials draped or attached over frames of poles that were charmed to be larger inside than they looked from the outside, somewhat resembling small homes with beds, chairs, tables, and a kitchen",
      "Appearances": "Harry Potter and the Goblet of Fire, Harry Potter and the Goblet of Fire (film), Harry Potter and the Goblet of Fire (film), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 1 (film)"
    },
    "Clankers": {
      "Name": "Clankers",
      "Owners": "Gringotts Wizarding Bank",
      "Use": "Clankers, also known as Goblin Noise Makers, were magical items which made a loud noise when shaken, which were used in Gringotts Wizarding Bank.",
      "Appearances": "Harry Potter and the Deathly Hallows (first appearance), Harry Potter and the Deathly Hallows: Part 2"
    },
    "Cloak of Invisibility": {
      "Name": "the Cloak of Invisibility was a magical artefact used to render the wearer invisible, and one of the fabled Deathly Hallows.",
      "Owners": "Death (according to legend), Ignotus Peverell, Ignotus Peverell's son, Iolanthe Peverell, Generations of Potters, Harry Potter, Fleamont Potter, James Potter, Albus Dumbledore (never used), Harry Potter",
      "Use": "This object is a magical artefact used to render the wearer invisible, and one of the fabled Deathly Hallows.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Philosopher's Stone (film), Harry Potter and the Chamber of Secrets, Harry Potter and the Chamber of Secrets (film), Harry Potter and the Prisoner Azkaban, Harry Potter and the Prisoner of Azkaban (film), Harry Potter and the Goblet of Fire, Harry Potter and Goblet of Fire (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Half-Blood Prince, Harry Potter and the Half-Blood Prince (film), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 1 (film) (appears in flashback(s)), Harry Potter and the Deathly Hallows: Part 2 (film)"
    },
    "Color-Change Ink": {
      "Name": "Color-Change Ink",
      "Owners": "Harry Potter",
      "Use": "Color-changing ink, a magic ink, switches, color as one writes.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Half-Blood Prince"
    },
    "Crystal Ball": {
      "Name": "Crystal Ball",
      "Owners": "Seers, Sybill Trelawney, Divination students",
      "Use": "This object is used to gaze into for the purpose of Divination",
      "Appearances": "Harry Potter and the Prisoner of Azkaban (first appearance), Harry Potter and the Prisoner of Azkaban (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Order of Phoenix (film), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 2 (film), Fantastic Beasts: The Crimes of Grindelwald - The Original Screenplay, Fantastic Beasts: The Crimes of Grindelwald (film)"
    },
    "Deluminator": {
      "Name": "Deluminator",
      "Owners": "Albus Dumbledore (formerly), Alastor Moody (briefly), Ron Weasley",
      "Use": "The Deluminator, also know as the Put-Outer, was a magical device used by Albus Dumbledore (the first known owner and designer of the one Deluminator known to exist) to remove light sources from the Deluminator's immediate surroundings, as well as bestow them.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance) (identified as 'Put-Outer'), Harry Potter and the Philosopher's Stone (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Half-Blood Prince, Harry Potter and the Deathly Hallows (first identified as Deluminator), Harry Potter and the Deathly Hallows: Part 1 (film), Fantastic Beasts: The Crimes of Grindelwald (appears in a deleted scene)"
    },
    "Detachable Cuff Ring": {
      "Name": "Detachable Cuff Link",
      "Owners": "N/A",
      "Use": "These objects were enchanted cuffs that could be attached to sleeves and allowed the wearer to cheat during examinations. Hogwarts School of Witchcraft and Wizardry banned the items from the examination hall while the fifth years took their Ordinary Wizarding Levels.",
      "Appearances": "Harry Potter and the Order of the Phoenix (first mentioned)"
    },
    "Dictograph": {
      "Name": "Dictograph",
      "Owners": "British Ministry of Magic",
      "Use": "This object is a telephonic instrument for picking up sounds in one room and transmitting them to another or recording the sounds",
      "Appearances": "Fantastic Beasts: The Crime of Grindelwald (film) (first appearance) (first identified as Dictograph)"
    },
    "Disappearing-Step Staircase": {
      "Name": "Disappearing-Step Staircase",
      "Owners": "Hogwarts School of Witchcraft and Wizardry",
      "Use": "These were staircases in Hogwarts castle that moved a step halfway up, meaning students crossing them had to jump up a step",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Goblet of Fire"
    },
    "Dumbledore's Army Coin": {
      "Name": "Dumbledore's Army Coin",
      "Owners": "Dumbledore's Army members",
      "Use": "These coins were fake galleons crated by Hermione Granger in 1995, in order to inform members of Dumbledore's Army when the next meeting would take place",
      "Appearances": "Harry Potter and the Order of the Phoenix (first appearance), Harry Potter and the Half-Blood Prince (mentioned only), Harry Potter and the Deathly Hallows"
    },
    "Durmstrang Ship": {
      "Name": "Durmstrang Ship,",
      "Owners": "Durmstrang students",
      "Use": "The Durmstrang Ship was a magical ship used by Durmstrang Institute to reach Hogwarts School of Witchcraft and Wizardry for the 1994 Triwizard TourNament. The ship could travel underwater, though, in practice, the students steered while Headmaster Igor Karkaroff stayed in his cabin. The ship presumably utilized a magical means of travelling from one large body of water to another.",
      "Appearances": "Harry Potter and the Goblet of Fire (first appearance), Harry Potter and the Goblet of Fire (film)"
    },
    "Durmstrang's Walking Sticks": {
      "Name": "Durmstrang Walking Sticks",
      "Owners": "Durmstrang Students",
      "Use": "These magical walking sticks belonged to Durmstrang Institute and were used by Durmstrang students when they arrived at Hogwarts School of Witchcraft and Wizardry during the Triwizard TourNament. They were thick wooden sticks, and were used in the Durmstrang students' introduction, leaving scorch marks every time they were stamped on the floor.",
      "Appearances": "Harry Potter and the Goblet of Fire (film) (first appearance)"
    },
    "EaziKleen Self-Propelling Scourers": {
      "Name": "EaziKleen Self-Propelling Scourers",
      "Owners": "Jae Kim, Madam Rosmerta, Molly Weasley",
      "Use": "EaziKleen Self-Propelling Scourers were a magical brand of scourers that scrubbed dirt away on their own accord",
      "Appearances": "Harry Potter and the Chamber of Secrets (film) (first appearance)"
    },
    "Enchanted Window": {
      "Name": "Enchanted Window",
      "Owners": "British Ministry of Magic",
      "Use": "This window was programmed by Magical Maintenance at the British Ministry of Magic to give those who looked out thew window to see certain Type of weather",
      "Appearances": "Harry Potter and the Order of the Phoenix (film)"
    },
    "Everlasting Icicle": {
      "Name": "Everlasting Icicle",
      "Owners": "Hogwarts School of Witchcraft and Wizardry, St Mungo's Hospital for Magical Maladies and Injuries",
      "Use": "An everlasting icicle was an icicle that never melted which was used as a magical Christmas decoration",
      "Appearances": "Harry Potter and the Goblet of FIre (first appearance), Harry Potter and the Order of the Phoenix"
    },
    "Everlasting Ink": {
      "Name": "Everlasting Ink",
      "Owners": " N/A",
      "Use": "Everlasting ink is a Type of ink. Presumably from its Name, anything written using this Type of ink is bewitched to last forever and never fade",
      "Appearances": "Harry Potter and the Deathly Hallows (first appearance)"
    },
    "Exploding Snap": {
      "Name": "Exploding Snap",
      "Owners": "Wizardkind",
      "Use": "Exploding Snap was a wizarding card game in which the cards spontaneously exploded during games.[2] The game was popular with students at Hogwarts School of Witchcraft and Wizardry.",
      "Appearances": "Harry Potter and the Chamber of Secrets (first appearance), Harry Potter and the Prisoner of Azkaban, Harry Potter and the Goblet of Fire, Harry Potter and the Order of the Phoenix, Harry Potter and the Half-Blood Prince,"
    },
    "Floating Golden Lantern": {
      "Name": "Floating Golden Lantern",
      "Owners": "Weasley Family",
      "Use": "Floating golden lanterns were a magical portable lighting divide used to illuminate broad areas",
      "Appearances": "Harry Potter and the Deathly Hallows (first appearance)"
    },
    "Floo Powder": {
      "Name": "Floo Powder",
      "Owners": "Various",
      "Use": "Floo powder was a glittery magical powder used by witches and wizards to travel by the Floo Network, which connected the fireplaces of nearly every wizarding household and building.[2] Through the used of Floo powder, witches and wizards were able to enter a fireplace at the origin building and exit a fireplace at the destination building.",
      "Appearances": "Harry Potter and the Chamber of Secrets (first appearance), Harry Potter and the CHamber of Secrets (film), Harry Potter and the Prisoner of Azkaban (mentioned only), Harry Potter and the Goblet of Fire, Harry Potter and the Goblet of Fire (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Order of the Phoenix (film), Harry Potter and the Half-Blood Prince"
    },
    "Flooboost Pro": {
      "Name": "Flooboost Pro",
      "Owners": "N/A",
      "Use": "Flooboost Pro was a 'Floo Powder Accelerator' that enhanced the functionality of Floo Powder. It was made by Wildsmith, the manufacturers of Flooboost Regular. It was advertised in the Daily Prophet in 1995 or 1996.",
      "Appearances": "Harry Potter and the Order of the Phoenix (mentioned only)"
    },
    "Flying Ford Anglia": {
      "Name": "Flying For Anglia",
      "Owners": "Arthur Weasley",
      "Use": "The Flying Ford Anglia was a light blue Ford Anglia 105E Deluxe that was enchanted by Arthur Weasley to fly,[2] as well as to become invisible, with the used of a specially installed device called an Invisibility Booster. It was also modified so that it could fit eight people, six trunks, two owls, and a rat comfortably.",
      "Appearances": "Harry Potter and the Chamber of Secrets (first appearance), Harry Potter and the Chamber of Secrets (film), Harry Potter and the Prisoner of Azkaban (mentioned only), Harry Potter and the Goblet of Fire (mentioned only), Harry Potter and the Order of the Phoenix (mentioned only), Harry Potter and the Half-Blood Prince (mentioned only), Harry Potter and the Deathly Hallows (mentioned only"
    },
    "French Ministry of Magic Alarm": {
      "Name": "French Ministry of Magic Emergency Alarm",
      "Owners": "French Ministry of Magic",
      "Use": "This emergency alarm was located within the French Ministry of Magic Headquarters, which was used to sound emergency situations within the Ministry, such as break-ins.",
      "Appearances": "Fantastic Beasts: The Crimes of Grindelwald - The Original Screenplay (first appearance), Fantastic Beasts: The Crimes of Grindelwald (movie)"
    },
    "Frolicsome Feline Plates": {
      "Name": "Frolicsome Feline Plates",
      "Owners": "Dolores Umbridge",
      "Use": "The Frolicsome Feline range of magical orNamental plates featured colorful, moving kittens, each wearing a unique bow around its neck",
      "Appearances": "Harry Potter and the Order of the Phoenix (first appearance), Harry Potter and the Order of the Phoenix (film), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 1 (film)"
    },
    "Gellert Grindelwald's Deathly Hallows Necklace": {
      "Name": "Gellert Grindelwald's Deathly Hallows Necklace",
      "Owners": "Gellert Grindelwald, Credence Barebone",
      "Use": "This necklace belonged to the Dark Wizard Gellert Grindelwald, and was gifted by him to Credence Barebone. It bore the sign of the Deathly Hallows, and was enchanted in such a way that would allow Grindelwald to track the movements of the wearer, and apparate instantly to their location should they have need of him.",
      "Appearances": "Fantastic Beasts: The Crimes of Grindelwald - The Original Screenplay (first appearance), Fantastic Beasts: The Crimes of Grindelwald (film)"
    },
    "Gellert Grindelwald's Pendant": {
      "Name": "Gellert Grendelwald's Pendant",
      "Owners": "Gellert Grindelwald (former), Newton 'Newt' Scamander (formerly), Albus Dumbledore (current owner)",
      "Use": "This pendant contained the sealed blood of Albus Dumbledore and Gellert Grindelwald after they made their blood pact in their youth",
      "Appearances": "Fantastic Beasts: The Crimes of Grindelwald - The Original Screenplay (first appearance), Fantastic Beasts: The Crimes of Grindelwald (film)"
    },
    "Gellert Grindelwald's Skull-Hookah": {
      "Name": "Gellert Grindelwald's Skull Hookah",
      "Owners": "Gellert Grindelwald",
      "Use": "This skull-hookah belong to Gellert Grindelwald, and was made of an aged human skull. When used, it allowed others to experience Grindelwald's visions",
      "Appearances": " Fantastic Beasts: THe Crimes of Grindelwald - The Original Screenplay, Fantastic Beasts: The Crime of Grindelwald (film)"
    },
    "Ghost Letter": {
      "Name": "Ghost Letter",
      "Owners": "Ghosts",
      "Use": "A ghost could write a transparent letter, translucent to living beings but apparently legible to other ghosts.[1] Sir Patrick Delaney-Podmore wrote one such letter in October of 1992 and sent it to Nicholas de Mimsy-Porpington.",
      "Appearances": "Harry Potter and the Chamber of Secrets"
    },
    "Giant Stone Hand": {
      "Name": "Giant Stone Hand",
      "Owners": "Borgin and Burkes, Hogwarts School of Witchcraft and Wizardry",
      "Use": "This Giant Stone Hand was a mysterious magical artefact of unknown origins and function,that had been for sale at Borgin and Burkes in Knockturn Alley for several years[1] by the early 1990s.",
      "Appearances": "Harry Potter and the Chamber of Secrets (film) (first appearance), Harry Potter and the Prisoner of Azkaban (film) (DVD special disc 2; 'Tour Lupin's Office), Harry Potter and hte Half-Blood Prince (film)"
    },
    "Gobstone": {
      "Name": "Gobstone",
      "Owners": "Gobstone players",
      "Use": "A Gobstone was a round magical ball used to play popular wizarding game Gobstones. Gobstones were similar to ordinary Muggle marbles, except that when a player lost a point in Gobstones, the stone squirted a putrid liquid at the player. Sold in sets of thirty, Gobstones were most commonly made of stone, but may also be made of precious metals,[1] such as gold.[2] The Noisy Hitter was a variety of Gobstone.",
      "Appearances": "Harry Potter and the Prisoner of Azkaban (first appearance), Harry Potter and the Goblet of Fire, Harry Potter and the Order of the Phoenix, Harry Potter and the Half-Blood Prince (mentioned only)"
    },
    "Golden Balloons": {
      "Name": "Golden Balloons",
      "Owners": "Weasley family",
      "Use": "These enchanted Golden Balloons were used during special parties as decorations",
      "Appearances": "Harry Potter adn the Deathly Hallows (first appearance)"
    },
    "Golden Snitch": {
      "Name": "Golden Snitch",
      "Owners": "Hogwarts School of Witchcraft and Wizardry, Quidditch Players, Harry Potter",
      "Use": "he Golden Snitch, often simply called the Snitch, is the third and smallest ball used in Quidditch. It is a walnut-sized gold-coloured sphere with silver wings. It flies around the Quidditch field at high speeds, sometimes pausing and hovering in place. The Seeker's goal is to catch the Snitch before the other team's seeker, which is worth one-hundred and fifty points. The game can only end when the Snitch has been caught, or by mutual agreement of the two teams' Captains; the latter is very rare, however, as one team would have to lose.[5] Going off of Ginny Weasley's statement, it would appear Snitches fly at varying speeds, or at least can wear out.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Philosopher's Stone (film), Harry Potter and the Chamber of Secrets, Harry Potter and the CHamber of Secrets (film), Harry Potter and the Prisoner of Azkaban, Harry Potter and the Prisoner of Azkaban (film), Harry Potter and the Goblet of FIre, Harry Potter and the Order of the Phoenix, Harry Potter and the Half-Blood Prince, Harry Potter and the Half-Blood Prince (film), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 1 (film), Harry Potter and the Deathly Hallows: Part 2 (film)"
    },
    "Grand Staircase": {
      "Name": "Grand Staircase",
      "Owners": "Hogwarts School of Witchcraft and Wizardry",
      "Use": "The Grand Staircase was a massive stairway in Hogwarts Castle, the structure was mainly used to access each floor of the castle, including the dungeons.[1] Rowena Ravenclaw was the Hogwarts founder who invented the concept of moving stairs.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Philosopher's Stone (film), Harry Potter and the Chamber of Secrets, Harry Potter and the Chamber of Secrets (film), Harry Potter and the Prisoner of Azkaban, Harry Potter and the Prisoner of Azkaban (film), Harry Potter and the Goblet of Fire, Harry Potter and the Goblet of Fire (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Order of the Phoenix (film), Harry Potter and the Half-Blood Prince, Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 2 (film) "
    },
    "Great Hall Floating Candles": {
      "Name": "Great Hall Floating Candles",
      "Owners": "Hogwarts School of Witchcraft and Wizardry",
      "Use": "The Great Hall floating candles[3] were sticks of wax floating and covering the entire ceiling of the Great Hall to give the Hogwarts students light while they were eating during a feast, breakfast, lunch or dinner.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Philosopher's Stone (film), Harry Potter and the Chamber of Secrets, Harry Potter and the Chamber of Secrets (film), Harry Potter and the Prisoner of Azkaban, Harry Potter and the Prisoner of Azkaban (film), Harry Potter and the Goblet of Fire, Harry Potter and the Goblet of Fire (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Order of the Phoenix (film), Harry Potter and the Half-Blood Prince, Harry Potter and the Half-Blood Prince (film), Harry Potter and the Deathly Hallows (appears in flashbacks), Fantastic Beasts: THe Crimes of Grindelwald - The Original Screenplay, Fantastic Beasts: The Crimes of Grindelwald (film)"
    },
    "Grow Your Own Wart Kit": {
      "Name": "Grow Your Own Warts Kit",
      "Owners": "Harry Potter",
      "Use": "A Grow-Your-Own-Warts kit was used to grow warts on a person's body.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance)"
    },
    "Gryffindor Girls' Staircase": {
      "Name": "Gryffindor Girls' Staircase",
      "Owners": "Hogwarts School of Witchcraft and Wizardry Students",
      "Use": "This staircase to the Gryffindor Girls' Dormitory was accessible from the Gryffindor Common Room. It was enchanted by Godric Gryffindor to turn into a slide should any boy attempt to enter it",
      "Appearances": "Harry Potter and the Order of the Phoenix (first appearance)"
    },
    "Harry Potter's FIrst Golden Snitch": {
      "Name": "Harry Potter's First Golden Snitch",
      "Owners": "Albus Dumbledore (formerly), Harry Potter",
      "Use": "his Golden Snitch was the Snitch used in the first match between Gryffindor and Slytherin during the 1991-1992 season, where it was caught by Harry Potter. It was later used by Albus Dumbledore to posthumously ensure that Marvolo Gaunt's ring would be safely delivered to Harry, while at the same time ensuring he could not access the Resurrection Stone set into it until he was ready.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Philosopher's Stone (film), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 1 (film), Harry Potter and the Deathly Hallows; Part 2 (film)"
    },
    "Harry Potter's Photo Album": {
      "Name": "Harry Potter's Photo Album",
      "Owners": "Harry Potter",
      "Use": "This photo album was created by Rubeus Hagrid and gifted to Harry Potter in 1992. It was full of moving pictures of James Potter, Lily Potter and Harry.",
      "Appearances": "Harry Potter and the Philosopher's Stone, Harry Potter and the Philosopher's Stone (film), Harry Potter and the Chamber of Secrets (film), Harry Potter and the Prisoner of Azkaban, Harry Potter and the Deathly Hallows"
    },
    "Haunted Mirror": {
      "Name": "Haunted Mirror",
      "Owners": "Janus Galloglass, clients of the above",
      "Use": "A haunted mirror was presumably a Type of magical mirror 'haunted' by some sort of spirit. The spirit (who might be a ghost) was presumably of some used to the owner of the Mirror. possibly in much the same way as a talking mirror.",
      "Appearances": "Harry Potter and the Philosopher's Stoned (first mentioned (Deluxe Illustrated Slipcase Edition)"
    },
    "Hermione Granger's Beaded Handbag": {
      "Name": "Hermione Granger's Beaded Handbag",
      "Owners": "Hermione Granger",
      "Use": "Hermione Granger owned a small, purple, beaded handbag, which she purchased in the summer of 1997 or earlier. She placed an Undetectable Extension Charm on it and inside it held many possessions she and her friends would need during their hunt for Voldemort's Horcruxes.",
      "Appearances": "Harry Potter and the Deathly Hallows (first appearance), Harry Potter and the Deathly Hallows: Part 1 (film), Harry Potter and the Deathly Hallows: Par 2 (film)"
    },
    "Hogwarts Express": {
      "Name": "Hogwarts Express",
      "Owners": "Hogwarts Railway Authorities",
      "Use": "THe Hogwarts Express was used to transport students from Kings Cross Station to Hogwarts School of Witchcraft and Wizardry",
      "Appearances": "Harry Potter and the Harry Potter and the Philosopher's Stone (film), Harry Potter and the CHamber of Secrets, Harry Potter and the Chamber of Secrets (film) Harry Potter and the Prisoner of Azkaban, Harry Potter and the Prisoner of Azkaban (film), Harry Potter and the Goblet of Fire, Harry Potter and the Goblet of Fire (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Order of the Phoenix (film), Harry Potter and the Half-Blood Prince (film), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 1 (film), Harry Potter and the Deathly Hallows: Part 2 (film)"
    },
    "Hogwarts School Loud Speakers": {
      "Name": "Hogwarts School Loud Speakers",
      "Owners": "Hogwarts School of Witchcraft and Wizardry",
      "Use": "These loudspeakers were used in Hogwarts School of Witchcraft and Wizardry to make school wide announcements",
      "Appearances": "Harry Potter and the Chamber of Secrets (film) (first appearance), Harry Potter and the Order of the Phoenix (film)"
    },
    "Hogwarts and Borgin and Burkes Vanishing Cabinet Pair": {
      "Name": "Hogwarts and Borgin and Burkes Vanishing Cabinet Pair",
      "Owners": "Hogwarts School of Witchcraft and Wizardry, Borgin and Burkes",
      "Use": "A pair of Vanishing Cabinets formed a passage between Hogwarts Castle -- the location of Hogwarts School -- and Borgin and Burkes, a dark magic shop in Knockturn Alley. The cabinets allowed objects placed in one cabinet to appear in the other. The passage was successfully used to transport several Death Eaters from Borgin and Burkes into Hogwarts School, hence commencing the Battle of the Astronomy Tower.",
      "Appearances": "Harry Potter an the Chamber of Secrets (first appearance), Harry Potter and the Order of the Phoenix (mentioned only (first identified as Hogwarts and Borgin and Burkes Vanishing Cabinet Pair), Harry Potter and the Half-Blood Prince, Harry Potter and the Half-Blood Prince (film), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 2 (appears in flashback(s))"
    },
    "Interdepartmental Memo": {
      "Name": "Interdepartmental Memo",
      "Owners": "British Ministry of Magic",
      "Use": "Interdepartmental memos were a method of communication between departments at the British Ministry of Magic. These memos were shaped like paper airplanes and flew to the recipient.",
      "Appearances": "Harry Potter and the ORder of the Phoenix (first appearance), Harry Potter and the Order of the Phoenix (film), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 1 (film)"
    },
    "Invisibility Booster": {
      "Name": "Invisibility Booster",
      "Owners": "Arthur Weasley",
      "Use": "The Invisibility Booster was a magical device Arthur Weasley installed on his family's Ford Anglia. It was activated by a small silver button on the car's dashboard, and would turn the car, its passengers, and everything else inside invisible",
      "Appearances": "Harry Potter and the Chamber of Secrets, Harry Potter and the Chamber of Secrets (film)"
    },
    "Invisible Ink": {
      "Name": "Invisible Ink",
      "Owners": "N/A",
      "Use": "Invisible Ink was a Type of magical ink that transfigured[2] anything written in it to become invisible. Text written in invisible ink can be rendered visible again in two ways, either by using a Revealer or the spell Aparecium",
      "Appearances": "Harry Potter and the Chamber of Secrets (first mentioned)"
    },
    "Jet Black Candle": {
      "Name": "Jet Black Candle",
      "Owners": "Hogwarts School of Witchcraft and Wizardry",
      "Use": "Jet Black Candles were a variety of magical candles used by ghosts. They burned dimmer light than normal candles",
      "Appearances": "Harry Potter and the Chamber of Secrets (first appearance)"
    },
    "Knight Bus": {
      "Name": "Knight Bus",
      "Owners": "N/A",
      "Use": "he Knight Bus was a triple-decker, purple AEC Regent III RT that assisted stranded individuals of the wizarding community through public transportation. It operated at a very fast speed and obstacles would jump out of its way, and it could also deceptively fit through small spaces. To hail the bus, a witch or wizard must stick their wand hand in the air in the same manner that a Muggle might do while hailing a Muggle Bus in the United Kingdom, though it is possible to book tickets for travel on the bus in advance.",
      "Appearances": "Harry Potter and the Prisoner of Azkaban (first appearance), Harry Potter and the Prisoner of Azkaban (film), Harry Potter and the Goblet of FIre (mentioned only), Harry Potter and the Order of the Phoenix, Harry Potter and the Half-Blood Prince (mentioned only), Harry Potter and the Half-Blood Prince (film) (flashback on disc 2, Harry Potter and the Deathly Hallows (mentioned only)"
    },
    "Leprechaun Gold": {
      "Name": "Leprechaun Gold",
      "Owners": "N/A",
      "Use": "Leprechaun gold was a material that was produced by Leprechauns, that possessed magical properties. It is also used as currency",
      "Appearances": "Harry Potter and the Goblet of Fire (first appearance), Harry Potter and the Deathly Hallows"
    },
    "Lestrange Family Tree Box": {
      "Name": "Lestrange Family Tree Box",
      "Owners": "Lestrange family",
      "Use": "This was an ornate box that contained the Lestrange family's family tree that recorded the descendants of the brothers Corvus (I) and Cyrille (I) Lestrange. The women, married as well as daughter, were recorded as flowers, while the men were recorded with Name and portraits on the branches on the tree.",
      "Appearances": "Fantastic Beasts: The Crimes of Grindelwald - The Original Screenplay (first appearance), Fantastic Beasts: The Crimes of Grindelwald (film)"
    },
    "Location Orb": {
      "Name": "Location Orb",
      "Owners": "French Ministry of Magic",
      "Use": "The Location Orb was a tracking device that tracked magical happenings all around the world, which was located within the French Ministry of Magic Headquarters.",
      "Appearances": "Fantastic Beasts: The Crimes of Grindelwald (film) (first appearance)"
    },
    "Lucius Malfoy's Walking Stick": {
      "Name": "Lucius Malfoy's Walking Stick",
      "Owners": "Lucius Malfoy, Draco Malfoy",
      "Use": "Lucius Malfoy's walking stick is an orNamental cane and heirloom of the Malfoy family. Most noticeably, however, it was owned and used by Lucius Malfoy. The cane itself is coated in shiny black lacquer. At the top of the stick is a silver snake's head, which has green crystal eyes. The snake's head is actually the handle of his wand, which is hidden inside the stick.",
      "Appearances": "Harry Potter and the Chamber of Secrets (film) (first appearance), Harry Potter and the Goblet of Fire (film), Harry Potter and the Order of the Phoenix (film), Harry Potter and the Half-Blood Prince (film), Harry Potter and the Deathly Hallows: Part 1 (film)"
    },
    "Luna Lovegood's Eagle Hat": {
      "Name": "Luna Lovegood's Eagle Hat",
      "Owners": "Luna Lovegood",
      "Use": "The eagle hat was a magical hat created by Luna Lovegood to show her support for the Ravenclaw Quidditch team when her team was playing against the Gryffindor Quidditch team at Hogwarts. On top of the hat was what appeared to be a living eagle, which flapped its wings.",
      "Appearances": "Harry Potter and the Order of the Phoenix (first appearance"
    },
    "Luna Lovegood's Lion-Topped Hat": {
      "Name": "Luna Lovegood's Lion-Topped Hat",
      "Owners": "Luna Lovegood",
      "Use": "The lion hat was an enchanted had that was created by Luna Lovegood. She wore it to show her support for the Gryffindor Quidditch team whenever they played against the Slytherin Quidditch team. When she tapped the hat with her wand, it let out an extremely realistic roar.",
      "Appearances": "Harry Potter and the Order of the Phoenix (first appearance), Harry Potter and the Half-Blood Prince, Harry Potter and the Half-Blood Prince (film)"
    },
    "Lunascope": {
      "Name": "Lunascope",
      "Owners": "Albus Dumbledore, Perpetua Fancourt, Newt Scamander, Gnarlak",
      "Use": "A Lunascope was an astronomical instrument invented by Perpetus Fancourt, which showed the phases of the moons. It was created to counter the difficulty of using Moon chart.",
      "Appearances": "Harry Potter an the Prisoner of Azkaban, Harry Potter and the Goblet of Fire (first appearance), Harry Potter and the Order of the Phoenix, Fantastic Beasts and Where to Find Them: The Original Screenplay, Fantastic Beasts and Where to Find Them (film)"
    },
    "MACUSA Real-Time Hex Indicator Map": {
      "Name": "MACUSA Real-Time Hex Indicator Map",
      "Owners": "Magical Congress of the United States of America (MACUSA)",
      "Use": "The MACUSA Real-Time Hex Indicator Map was used to track the casting of hexes across the United States of America.",
      "Appearances": "Fantastic Beasts and Where to Find Them (film)"
    },
    "Magic Lantern": {
      "Name": "Magic Lantern",
      "Owners": "N/A",
      "Use": "A magic lantern was a magical lantern that was enchanted to produce light, without the need for being powered by fuel or electricity",
      "Appearances": "Harry Potter and the Deathly Hallows (first appearance)"
    },
    "Magical Exposure Threat Level Measurer": {
      "Name": "Magical Exposure Threat Level Measurer",
      "Owners": "Magical Congress of the United States of America (MACUSA)",
      "Use": "This measurer was a magical device used in the United States of America that measured the threat level of exposure of magic to the No-Maj people. It hung in the central foyer of the Magical Congress of the United States of America. It resembled a barometer, had four faces, and black hands. Various colours indicated the threat levels: Zero Threat (Green), Level One: Low Threat (Green), Level Two: Moderate Threat (Green), Level Three: High Alert (Blue),Level Four: Danger (Yellow), Level Five: Severe: Unexplained Activity (Orange),Level Six: Emergency (Red). There were also counters indicating how many witch hunts have ocurred, how many times witches and wizards had been exposed, and how many times the Memory Charm had been used on non-magical persons. If the wizarding community in America was close to exposure, the device sounded an alarm informing the Aurors of the impending threat.",
      "Appearances": "Fantastic Beasts and Where to Find Them: The Original Screenplay, Fantastic Beasts and Where to Find Them (film)"
    },
    "Magical Megaphone": {
      "Name": "Magical Megaphone",
      "Owners": "Hogwarts School of Witchcraft and Wizardry",
      "Use": "A magical megaphone was similar to a Muggle megaphone, except instead of being powered by electricity, it is bewitched with an Amplifying Charm or similar spell to amplify the user's voice much louder than the Muggle version.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Philosopher's Stone (film), Harry Potter and the Chamber of Secrets, Harry Potter and the Chamber of Secrets (film), Harry Potter and the Prisoner of Azkaban, Harry Potter and the Prisoner of Azkaban (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Half-Blood Prince, Harry Potter and the Half-Blood Prince (film)"
    },
    "Magical Tape Measurer": {
      "Name": "Magical Tape Measurer",
      "Owners": "Garrick Ollivander, Madam Malkin",
      "Use": "Magical tape measures are measuring devices that are capable of moving of their accord, so that the owner may perform other tasks while taking measurements",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance)"
    },
    "Magics Hydrometer": {
      "Name": "Magics Hydrometer",
      "Owners": "Swotts a& Swotts Scotch Distilleries (possibly)",
      "Use": "A Magic Hydrometer is, presumably, a magical version of an alcoholmeter, a tool used to determine the alcohol proof of a beverage",
      "Appearances": "Harry Potter and the Philosopher's Stone (film) (first appearance)"
    },
    "Metamorph Medal": {
      "Name": "Metamorph Medal",
      "Owners": "N/A",
      "Use": "Metamorph Medals were magical objects supposedly to help the wearer metamorphose. These are actually scam objects; they made the wearer turn orange, or in worst cases, causes the wearer to break out in tentacle-like warts.",
      "Appearances": "Harry Potter and the Half-Blood Prince (first mentioned)"
    },
    "Gringotts' Mine Cart": {
      "Name": "Gringotts' Mine Cart",
      "Owners": "Gringotts' staff",
      "Use": "A Gringotts' Mine Cart was used to transport customers between the vaults of Gringotts Wizarding Bank. Only goblins employed at Gringotts bank could operate these and had special places for lanterns. They moved on specially laid tracks at the bank and were magically operated.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first mentioned0, Harry Potter and the Philosopher's Stone (film), Harry Potter and the Chamber of Secrets, Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 2 (film)"
    },
    "Ministry of Magic Fleet of Cars": {
      "Name": "Ministry of Magic Fleet of Cars",
      "Owners": "British Ministry of Magic",
      "Use": "The Ministry of Magic owned a fleet of cars, for the transportation of Ministry officials and their luggage. The Ministry bought the cars from Muggle manufacturers sometime in the twentieth century and later modified them with 'various useful charms' in order to increase their interior capacity and to be able to slide through gaps that non-enchanted cars would not be able to manage.",
      "Appearances": "Harry Potter and the Prisoner of Azkaban (first appearance), Harry Potter and the Goblet of Fire (mentioned only), Harry Potter and the Order of the Phoenix (mentioned only), Harry Potter and the Half-Blood Prince"
    },
    "Mirror of Erised": {
      "Name": "Mirror of Erised",
      "Owners": "Hogwarts School of Witchcraft and Wizardry",
      "Use": "The Mirror of Erised was a magical mirror, which, according to Albus Dumbledore, shows the 'deepest, most desperate desire of our hearts.' The Name 'Erised' is 'desire' spelled backwards, as if reflected in a mirror. The happiest and most satisfied person in the world would look in the mirror and see a reflection of them, exactly as they were, for they would then have no one and nothing more to yearn or desire for that the mirror could ever show them. But of course, it is intrinsically inherent for human nature to desire something greater than one's own self - meaning that an event wherein the mirror fails to carry out its intended purpose rarely, if at all, happens.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Philosopher's Stone (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Order of the Phoenix (film) (appears in flashback(s)), Harry Potter and the Half-Blood Prince (mentioned only), Harry Potter and the Half-Blood Prince (film) (flashback on disc 2)"
    },
    "Moleskin Pouch": {
      "Name": "Moleskin Pouch",
      "Owners": "Harry Potter",
      "Use": "Mokeskin pouch was a kind of small magical bag made of Mokeskin that was used for storing items, which no one but the owner could get out. It appeared small on the outside, but an enchantment allowed it to have much greater carrying capacity than any non-magical pouch of comparable size.",
      "Appearances": "Harry Potter and the Deathly Hallows (first appearance)"
    },
    "Mad-Eye Moody's Trunk": {
      "Name": "Mad-Eye Moody's Trunk",
      "Owners": "Alastor Moody, Bartemius Crouch Junior",
      "Use": "Mad-Eye Moody's trunk was a heavily bewitched magical trunk owned by Alastor Moody",
      "Appearances": "Harry Potter and the Goblet of Fire (first appearance), Harry Potter and the Goblet of Fire (film)"
    },
    "House of Black Music Box": {
      "Name": "House of Black Music Box",
      "Owners": "House of Black",
      "Use": "The House of Black owned an enchanted music box which would lull the listener to sleep with a sinister, tinkling tune. Members of the Order of the Phoenix came across this box whilst cleaning 12 Grimmauld Place, with Ginny Weasley closing the box before she and several others fell asleep.",
      "Appearances": "Harry Potter and the Order of the Phoenix"
    },
    "Nicolas Flamel's Card": {
      "Name": "Nicolas Flamel's Card",
      "Owners": "Nicolas Flamel (previously), Albus Dumbledore (previously), Newton (Newt) Scamander",
      "Use": "This card was a magical piece of chard that contained directions to the Flamel House via an enchanted arrow on the paper",
      "Appearances": "Fantastic Beasts: The Crime of Grindelwald (film) (first appearance), Fantastic Beasts: The Crimes of Grindelwald (film)"
    },
    "Nicolas Flamel's Crystal Ball": {
      "Name": "Nicolas Flamel's Crystal Ball",
      "Owners": "Nicolas Flamel",
      "Use": "Nicolas Flamel's crystal ball was an orb that let Nicolas see the future",
      "Appearances": "Fantastic Beasts: The Crimes of Grindelwald - The Original Screenplay (first appearance), Fantastic Beasts: The Crimes of Grindelwald (film)"
    },
    "Oliver Wood's Quidditch Diagrams": {
      "Name": "Oliver Wood's Quidditch Diagrams",
      "Owners": "Oliver Wood",
      "Use": "During his time as Captain of the Gryffindor Quidditch team, Oliver Wood used a number of diagrams to show new maneuvers and tactics to his team. These diagrams could be animated with the tap of a wand to further showcase the moves in question.",
      "Appearances": "Harry Potter and the Chamber of Secrets (first appearance), Harry Potter and the Chamber of Secrets (film), Harry Potter and the Goblet of Fire (mentioned only)"
    },
    "Omnioculars": {
      "Name": "Omnioculars",
      "Owners": "Harry Potter, Ron Weasley, Hermione Granger",
      "Use": "Omnioculars were the wizarding equivalent of Muggle binoculars, but with the additional features of being able to magically slow down ad replay action",
      "Appearances": "Harry Potter and the Goblet of Fire (first appearance), Harry Potter and the Goblet of Fire (film)"
    },
    "Orrery": {
      "Name": "Orrery",
      "Owners": "Sybill Trelawney",
      "Use": "Orreries were models of the sun, planets and moons of the solar system, used for studying Astronomy. Sybill Trelawney used one of all nine planets (including Pluto) while teaching Astrology during Divination in 1995.",
      "Appearances": "Harry Potter and the Prisoner of Azkaban (film) (possible appearance), Harry Potter and the Goblet of Fire (first appearance)"
    },
    "Owl Lecturn": {
      "Name": "Owl Lecturn",
      "Owners": "Hogwarts School of Witchcraft and Wizardry",
      "Use": "The Owl Lecturn[3] was an owl-shaped magical podium located in the Great Hall at Hogwarts School of Witchcraft and Wizardry,[1] that dated back to at least the late 1800s.",
      "Appearances": "Harry Potter and the Prisoner of Azkaban (film), Harry Potter and the Goblet of Fire (film) (non-canonical appearance), Harry Potter and the Order of the Phoenix (film) (non-canonical appearance), Harry Potter and the Half-Blood Prince (film) (non-canonical)"
    },
    "Pensieve": {
      "Name": "Pensieve",
      "Owners": "Headmasters and Headmistresses of Hogwarts",
      "Use": "The Pensieve was a magical device used to review memories. It had the appearance of a shallow stone or metal basin, into which runes and strange symbols were carved and precious stones were fitted. It was filled with a silvery substance that appears to be a cloudy liquid/gas; the collected memories of people who had siphoned their recollections into it.",
      "Appearances": "Harry Potter and the Goblet of Fire (first appearance), Harry Potter and the Goblet of Fire (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Half-Blood Prince, Harry Potter and the Half-Blood Prince (film), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 1 (film) (appears in flashback(s)), Harry Potter and th Deathly Hallows: Part 2"
    },
    "Perkin's Tent": {
      "Name": "Perkin's Tent",
      "Owners": "Perkins, Weasley family (formerly), Hermione Granger, Harry Potter",
      "Use": "Perkins, who worked with Arthur Weasley in the Misuse of Muggle Artefacts Office, owned a tent that is charmed to be larger on the inside than it appears to be on the outside, most likely with the Undetectable Extension Charm.",
      "Appearances": "Harry Potter and the Goblet of Fire (first appearance), Harry Potter and the Goblet of Fire (film), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 1 (film)"
    },
    "Philosopher's Stone": {
      "Name": "Philosopher's Stone",
      "Owners": "Nicolas Flamel",
      "Use": "The Philosopher's Stone was a legendary alchemical substance with magical properties. This ruby-red stone could be used to create the Elixir of Life, which made the drinker immortal, as well as transform any metal into pure gold. The only known Stone to have ever existed was created by the famed alchemist Nicolas Flamel.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Philosopher's Stone (film), Harry Potter and the Goblet of Fire (mentioned only), Harry Potter and the Order of the Phoenix (mentioned only), Harry Potter and the Half-Blood Prince (mentioned only), Harry Potter and the Deathly Hallows (mentioned only), Fantastic Beasts: The Crimes of Grindelwald - The Original Screenplay, Fantastic Beasts: The Crimes of Grindelwald (film)"
    },
    "Phoenix Fire Lighters": {
      "Name": "Phoenix Fire Lighters",
      "Owners": "Molly Weasley",
      "Use": "Phoenix Fire Lighters is a magical brand of firelighters which, according to the information printed on the box, creates eternal fire. Molly Weasley kept a box of these fire lighters at The Burrow in the 1990s.",
      "Appearances": "Harry Potter and the Chamber of Secrets (film) (first appearance)"
    },
    "Potter Memorial": {
      "Name": "Potter Memorial",
      "Owners": "St. Jerome's Graveyard",
      "Use": "The Potter Memorial commemorated James and Lily Potter and also included  dedication to Harry Potter",
      "Appearances": "Harry Potter and the Deathly Hallows (first appearance)"
    },
    "Prophecy Record": {
      "Name": "Prophecy Record",
      "Owners": "British Ministry of Magic",
      "Use": "Prophecy Records are used to keep track of prophecies made by Seers.",
      "Appearances": "Harry Potter and the Order of the Phoenix (first appearance), Harry Potter and the Order of the Phoenix (film), Harry Potter and the Half-Blood Prince (mentioned only)"
    },
    "Quick-Quotes Quill": {
      "Name": "Quick-Quotes Quill",
      "Owners": "Rita Skeeter",
      "Use": "A Quick-Quotes Quill was a magical quill that wrote automatically as the subject spoke. However, the quill did not record verbatim what the subject said, but rather took a subject's words and created sensational and inaccurate tales that bore little resemblance to actual events.",
      "Appearances": "Harry Potter and the Goblet of Fire (first appearance), Harry Potter and the Goblet of Fire (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Half-Blood Prince (film) (seen on disc 2), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 1 (film) (seen on book cover"
    },
    "Rainbow Bath Taps": {
      "Name": "Rainbow Bath Taps",
      "Owners": "Hogwarts School of Witchcraft and Wizardry",
      "Use": "Rainbow Bath Taps[2] were hundreds of enchanted golden bath taps that were fitted in the Prefects' Bathroom at Hogwarts Castle.[2][1] Each of these taps ran their own differently coloured and treated bathwater and bubble baths, each with different fragrances and remedies, providing students with a relaxing experience in the special bath.",
      "Appearances": "Harry Potter and the Goblet of Fire (first appearance), Harry Potter and the Goblet of Fire (film)"
    },
    "Remembrall": {
      "Name": "Remembrall",
      "Owners": "Neville Longbottom",
      "Use": "A Remembrall is a magical large marble-sized glass ball that contains smoke which turns red when its owner or user has forgotten something. It turns clear once whatever was forgotten is remembered.",
      "Appearances": "Harry Potter an the Philosopher's Stone (first appearance), Harry Potter and the Philosopher's Stone (film), Harry Potter and the Order of the Phoenix (mentioned only)"
    },
    "Resurrection Stone": {
      "Name": "Resurrection Stone",
      "Owners": "Cadmus Peverell, Generations of Guants, Marvolo Guant, Morfin Guant, Tom Riddle, Albus Dumbledore, Harry Potter",
      "Use": "The Resurrection Stone was one of the fabled Deathly Hallows. In The Tale of the Three Brothers, it was the second Hallow created, supposedly by Death himself. It was bestowed upon Cadmus Peverell after he requested, as his bounty, something with the power to recall loved ones from Death. According to legend, whoever reunited it with the other two Hallows (the Elder Wand and the Cloak of Invisibility) would become the Master of Death. It was one of the two Hallows known to have been successfully passed down from generation to generation since Cadmus's time. In 1943 it passed to the possession of Tom Riddle who unknowingly stole it while it was still concealed in Marvolo Gaunt's Ring, which he turned into a Horcrux. The ring was destroyed in 1996 by Albus Dumbledore, but the stone was placed in Harry Potter's first Golden Snitch until it passed into the possession of Harry Potter who used it to great success in the Second Wizarding War.",
      "Appearances": "Harry Potter and the Half-Blood Prince (first appearance), Harry Potter and the Half-Blood Prince (film), Harry Potter and the Deathly Hallows (first identified as the Resurrection Stone, Harry Potter and the Deathly Hallows: Part 1 (film) (appears in flashback(s)), Harry Potter and the Deathly Hallows: Part 2"
    },
    "Revealer": {
      "Name": "Revealer",
      "Owners": "Jae Kim, Hermione Granger",
      "Use": "A Revealer was a magical device used to render invisible writing visible. It had the appearance of an ordinary Muggle eraser, although it had a bright red color.",
      "Appearances": "Harry Potter and the Chamber of Secrets (first appearance)"
    },
    "Rogue Bludger": {
      "Name": "Rogue Bludger",
      "Owners": "Hogwarts School of Witchcraft or Wizardry",
      "Use": "The rogue bludger's goal was to assault and injure Harry Potter during a Quidditch match",
      "Appearances": "Harry Potter and the Chamber of Secrets (first appearance), Harry Potter and the Chamber of Secrets (film)"
    },
    "Ronald Weasley's Wireless Radio": {
      "Name": "Ronald Weasley's Wireless Radio",
      "Owners": "Ronald Weasley",
      "Use": "Ronald Weasley used his wireless radio to try to tune into Potterwatch for weeks until he figured out the password, 'Albus'.",
      "Appearances": "Harry Potter and the Deathly Hallows (first appearance), Harry Potter and the Deathly Hallows: Part 1 (film)"
    },
    "Rotating Tower": {
      "Name": "Rotating Tower",
      "Owners": "Albus Dumbledore",
      "Use": "A Rotating tower is a tall device divided in several stacked sections. The sections magically rotate on top of each other. The purpose of this device is unknown.",
      "Appearances": "Harry Potter and the Chamber of Secrets (film) (first appearance), Harry Potter and the Goblet of Fire (film), Harry Potter and the Half-Blood Prince (film), Harry Potter and the Deathly Hallows: Part 2 (film) (appears in flashback(s)), Fantastic Beasts: The Crimes of Grindelwald (film)"
    },
    "Self-Correcting Ink": {
      "Name": "Self-Correcting Ink",
      "Owners": "N/A",
      "Use": "Self-Correcting Ink was a Type of ink that presumably magically changes whatever was written with it to be correct. used of this ink was banned during exams from the Wizarding Examinations Authority, such as Ordinary Wizarding Levels.",
      "Appearances": "Harry Potter and the Order of the Phoenix (first mentioned)"
    },
    "Self-Inking Quill": {
      "Name": "Self-Inking Quill",
      "Owners": "N/A",
      "Use": "A Self-Inking Quill was a tpe of quill that probably inked itself.",
      "Appearances": "Harry Potter and the Half Blood Prince"
    },
    "Self-Knitting Needles": {
      "Name": "Self-Knitting Needles",
      "Owners": "N/A",
      "Use": "Self-Knitting Needles are a special Type of wizarding knitting needles imbued with a charm to make them knit on their own",
      "Appearances": "Harry Potter and the CHamber of Secrets (film)"
    },
    "Self-Operating Typewriters": {
      "Name": "Self-Operating Typewriters",
      "Owners": "Magical Congress of the United States of America (MACUSA)",
      "Use": "Self-operating Typewriters were machines used for typing on pieces of paper. Self-operating Typewriters were enchanted to work automatically without needing someone to operate them.",
      "Appearances": "Fantastic Beasts and Where to Find Them - The Original Screenplay (first appearance), Fantastic Beasts and Where to Find Them (film)"
    },
    "Self-Shuffling Playing Cards": {
      "Name": "Self-Shuffling Playing Cards",
      "Owners": "Ron Weasley",
      "Use": "Self-Shuffling playing cards are charmed to shuffle themselves",
      "Appearances": "Harry Potter and the Chamber of Secrets (first appearance)"
    },
    "Shamrock Hat": {
      "Name": "Shamrock Hat",
      "Owners": "Ginny Weasley, Ron Weasley",
      "Use": "A Shamrock hat was a green-coloured hat, which was decorated with Irish shamrocks, which were often worn to show support for the Irish National Quidditch team at Quidditch matches.",
      "Appearances": "Harry Potter and the Goblet of Fire (first appearance), Harry Potter and the Goblet of Fire (film)"
    },
    "Sirius Black's Motorbike": {
      "Name": "Sirius Black's Motorbike",
      "Owners": "Sirius Black (previous owner), Rubeus Hagrid (borrowed only), Harry Potter (owner)",
      "Use": "This motorbike was a magical motorcycle owned by Harry Potter that previously belonged to his godfather, Sirius Black, which Harry inherited after Sirius was killed by Bellatrix Lestrange during the Battle of the Department of Mysteries. It had a large engine (suggested by the noise made when active and the fact that it could carry a sidecar). It also appeared to have a kickstart.[1] Magic made it much larger than when it was manufactured, emitting a very loud roar. When Hagrid, a half-giant, rode it, the motorbike was large enough to fit him and could still carry an ordinary-sized person in its sidecar. Another spell made it able to fly fast enough to compete with a broomstick.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Philosopher's Stone (film), Harry Potter and the Prisoner of Azkaban (mentioned only), Harry Potter and the Order of the Phoenix (mentioned only), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 1 (film)"
    },
    "Sirius Black's Penknife": {
      "Name": "Sirius Black's Penknife",
      "Owners": "Sirius Black (formerly), Harry Potter",
      "Use": "Sirius Black's penknife had attachments designed to open any lock and untie any knot, even if they have been protected against the Unlocking Charm or similar spells. To use the device to open a locked door, one inserted its blade into the crack between door and door frame, then slide it up and down. However, there are some doors that cannot be opened by this knife, such as the door to the Love Chamber in the Department of Mysteries. That particular lock caused the blade to melt.",
      "Appearances": "Harry Potter and the Goblet of Fire (first appearance), Harry Potter and the Order of the Phoenix"
    },
    "Slughorn's Hourglass": {
      "Name": "Slughorn's Hourglass",
      "Owners": "Horace Slughorn",
      "Use": "The hourglass' sand ran accordingly with the quality of the conversation: if stimulating, the sand ran slowly.",
      "Appearances": "Harry Potter and the Half-Blood Prince (film)"
    },
    "Spectrespecs": {
      "Name": "Spectrespecs",
      "Owners": "Luna Lovegood",
      "Use": "Spectrespecs were large, colorful spectacles that were given away free in an issue of The Quibbler in 1996. They were described as making their wearer look like a 'demented, multicolored owl.' They made wrackspurts (invisible creatures that floated through one's ears causing their brain to go fuzzy) visible to the wizarding eye, according to Luna Lovegood.",
      "Appearances": "Harry Potter and the Half-Blood Prince (first appearance), Harry Potter and the Half-Blood Prince (film)"
    },
    "Sum-Solving Ink": {
      "Name": "Sum-Solving Ink",
      "Owners": "Luna Lovegood",
      "Use": "Sum-solving ink was a Type of ink that presumably helped solve mathematical problems. Luna Lovegood owned a bottle of turquoise sum-solving ink, but someone took it from her and hid it during the 19951996 school year, prompting her to post a notice asking for the return of it and several other missing possessions.",
      "Appearances": "Harry Potter and the Order of the Phoenix (film) (first mentioned) (mentioned on a poster)"
    },
    "Sweeper": {
      "Name": "Sweeper",
      "Owners": "British Ministry of Magic",
      "Use": "Sweepers, used to clean, consisted of a metal body with a large bag attached to the back and a hoover head at the front, as well as several limbs ending in a variety of brushes and dusters. Sweepers moved autonomously on two wheels and could lift their arms from the ground to clean raised surfaces or people. They bore a heavy resemblance to non-magical vacuum cleaners.",
      "Appearances": "Fantastic Beasts: The Crimes of Grindelwald (film)"
    },
    "Cave Boat": {
      "Name": "Cave Boat",
      "Owners": "Tom Riddle",
      "Use": "This boat was used to get to the island in the middle of the lake in the Horcrux cave, where the locket Horcrux was hidden",
      "Appearances": "Harry Potter and the Half-Blood Prince (first appearance), Harry Potter and the Half-Blood Prince (film), Harry Potter and the Deathly Hallows (appears in vision(s))"
    },
    "Time Turner": {
      "Name": "Time Turner",
      "Owners": "Hermione Granger (formerly), Albus Dumbledore, Minerva McGonagall, British Ministry of Magic (destroyed)",
      "Use": "A Time-Turner was a magical device used for time travel. It was a special timepiece which resembled an hourglass on a necklace.",
      "Appearances": "Harry Potter and the Prisoner of Azkaban (first appearance), Harry Potter and the Prisoner of Azkaban (film), Harry Potter and the Order of the Phoenix, Harry Potter and the Half-Blood Prince (mentioned only)"
    },
    "Two-Way Mirror": {
      "Name": "Two-Way Mirror",
      "Owners": "James Potter, Sirius Black, Harry Potter, Mundungus Fletcher, Aberforth Dumbledore",
      "Use": "A two-way mirror was one in a pair of mirrors that were magically connected. This allowed people to communicate with each other whilst in different locations.",
      "Appearances": "Harry Potter and the Order of the Phoenix (first appearance), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 1 (film), Harry Potter and the Deathly Hallows: Part 2 (film)"
    },
    "Underwater Viewing Scope": {
      "Name": "Underwater Viewing Scope",
      "Owners": "Alastor Moody",
      "Use": "An Underwater Viewing Scope was a magical device used to see underwater.",
      "Appearances": "Harry Potter and the Goblet of Fire (film) (cut content)"
    },
    "Vanishing Cabinet": {
      "Name": "Vanishing Cabinet",
      "Owners": "Hogwarts School of Witchcraft and Wizardry, Borgin and Burkes",
      "Use": "A pair of Vanishing Cabinets would act as a passage between two places. If an object had been placed in one, it would appear in the other.",
      "Appearances": "Harry Potter and the Chamber of Secrets (first appearance), Harry Potter and the Order of the Phoenix (mentioned only), Harry Potter and the Half-Blood Prince, Harry Potter and the Half-Blood Prince (film), Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Par 2 (film) (appears in flashback(s))"
    },
    "Veil": {
      "Name": "Veil",
      "Owners": "British Ministry of Magic, Department of Mysteries",
      "Use": "The Veil was an enigmatic structure located in the Department of Mysteries. It seemed to be a manifestation of the barrier between the land of the living and the land of the dead. One could not travel freely between the two worlds, as it was a one-way trip. The Unspeakables who worked in the Department of Mysteries likely studied it closely.",
      "Appearances": "Harry Potter and the Order of the Phoenix (first appearance), Harry Potter and the Order of the Phoenix (film), Harry Potter and the Deathly Hallows (mentioned only)"
    },
    "Walls Pretending to be Doors": {
      "Name": "Walls Pretending to be Doors",
      "Owners": "N/A",
      "Use": "There exist walls that pretend to be doors withing Hogwarts Castle, which annoy first year students trying to find their way around",
      "Appearances": "Harry Potter and the Philosopher's Stone (first mentioned)"
    },
    "Wand Weigher": {
      "Name": "Wand Weigher",
      "Owners": "Ministry of Magic",
      "Use": "This was a brass instrument used to identify a wand's length, core material, and the length of time it has been used",
      "Appearances": "Harry Potter and the Order of the Phoenix (first appearance)"
    },
    "Weasley Clock": {
      "Name": "Weasley Clock",
      "Owners": "Weasley family",
      "Use": "The Weasley Clock was a magical clock owned by the Weasley family which individually monitored each of their whereabouts. Located in the living room at The Burrow, the clock had nine golden hands, one for every member of the household.In place of hours on the clock's face were a series of possible locations, including 'home,' 'school', 'work', 'travelling', 'lost', 'hospital', 'prison', and 'mortal peril.",
      "Appearances": "Harry Potter and the Chamber of Secrets (first appearance), Harry Potter and the Chamber of Secrets (film), Harry Potter and the Goblet of Fire, Harry Potter and the Half-Blood Prince, Harry Potter and the Half-Blood Prince (film), Harry Potter and the Deathly Hallows: Part 1 (film"
    },
    "Winged Keys": {
      "Name": "Winged Keys",
      "Owners": "Filius Flitwick",
      "Use": "The Winged Keys, also known as Flying Keys, were keys that were enchanted with the Flying charm by Professor Filius Flitwick to guard the Philosopher's Stone.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appeared), Harry Potter and the Philosopher's Stone (film)"
    },
    "Wireless": {
      "Name": "Wireless",
      "Owners": "Weasley Family",
      "Use": "A wireless, also referred to as a radio, is an audio sound broadcasting service and a form of long-distance communication and entertainment in the wizarding world. Unlike the Muggle variation, it is powered by magic, not electricity.",
      "Appearances": "Harry Potter and the Chamber of Secrets (first appearance), Harry Potter and the Prisoner of Azkaban (mentioned only), Harry Potter and the Goblet of Fire (mentioned only), Harry Potter and the Order of the Phoenix (film), Harry Potter and the Half-Blood Prince, Harry Potter and the Deathly Hallows, Harry Potter and the Deathly Hallows: Part 1 (film), Harry Potter and the Deathly Hallows: Part 2 (film)"
    },
    "Wizard Cracker": {
      "Name": "Wizard Cracker",
      "Owners": "N/A",
      "Use": "A Wizard Cracker (also known as a Wizarding Cracker) was a magical kind of Christmas cracker that wizards often gifted to each other around Christmas. It held a small gift inside. Unlike Muggle crackers, Wizard Crackers went off with a bang as loud as a cannon blast, enveloping everyone nearby in a cloud of blue smoke, rather than just a small pop. The gifts in comparison to the Muggle counterpart were often far more unique or genuine in quality, with the hats being as durable as the real thing, and the gifts being rather peculiar.",
      "Appearances": "Harry Potter and the Philosopher's Stone (first appearance), Harry Potter and the Prisoner of Azkaban, Harry Potter and the Goblet of Fire, Harry Potter and the Goblet of Fire (film), Harry Potter and the Half-Blood Prince (film)"
    },
    "Wizard Checkers": {
      "Name": "Wizard's Checkers",
      "Owners": "N/A",
      "Use": "Wizard's Checkers was presumably a board game similar to draughts and played between two players using white and black circular pieces.",
      "Appearances": "Fantastic Beats and Where to Find Them (film)"
    }
  }
}
